Revit 2024 API
IntersectionResultArray Class
An array that can contain any type of object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class IntersectionResultArray : APIObject,
	IEnumerable
Visual Basic
Public Class IntersectionResultArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class IntersectionResultArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.IntersectionResultArray
See Also
IntersectionResultArray Members
Autodesk.Revit.DB Namespace